{
  "Lion": {
    "scientific_name": "Panthera leo",
    "common_name": "Lion",
    "summary": "Lions are apex predators and the second-largest living cat species. Known as the \"King of the Jungle,\" they are the only cats that live in social groups called prides. Males are distinguished by their impressive manes.",
    "personality": "Powerful, social, and territorial. Lions are cooperative hunters with complex social hierarchies. Males are protective, while lionesses do most of the hunting.",
    "likes": "Resting in shade (sleep 16-20 hours/day), hunting in groups, fresh meat, socializing with pride members, and roaring to mark territory",
    "dislikes": "Water (though they can swim if necessary), hyenas competing for food, being challenged for dominance, and excessive heat",
    "habitat": "African savannas, grasslands, and open woodlands. Small population exists in Gir Forest, India",
    "conservation_status": "Vulnerable",
    "population_trend": "Declining - population declined by 43% over past 21 years",
    "threats": "Habitat loss, human-wildlife conflict, poaching",
    "fun_fact": "A lion's roar can be heard from up to 5 miles away - the loudest roar of any big cat!",
    "weight_range": "120-190 kg (females), 150-250 kg (males)",
    "lifespan": "10-14 years in wild, up to 20 years in captivity",
    "diet": "Carnivore - zebras, wildebeest, antelopes, buffalo"
  },
  "Cat": {
    "scientific_name": "Felis catus",
    "common_name": "Domestic Cat",
    "summary": "Domestic cats are small carnivorous mammals that have been companions to humans for over 9,500 years. They are skilled hunters with retractable claws, excellent night vision, and acute hearing.",
    "personality": "Independent yet affectionate, territorial, curious, and playful. Each cat has a unique personality ranging from shy to outgoing.",
    "likes": "Warm sunny spots, high places for observation, interactive play, grooming, catnip, and quality sleep (12-16 hours daily)",
    "dislikes": "Water (most cats), citrus scents, loud noises, being restrained, dirty litter boxes, and unfamiliar people",
    "habitat": "Adapted to human environments worldwide; originally from Middle Eastern wildcats",
    "conservation_status": "Not threatened",
    "population_trend": "Stable - estimated 600+ million domestic cats worldwide",
    "threats": "None (domesticated species)",
    "fun_fact": "Cats spend 70% of their lives sleeping - that's 13-16 hours a day! They also have a specialized collarbone allowing them to always land on their feet.",
    "weight_range": "3.5-7 kg (varies by breed)",
    "lifespan": "12-18 years (indoor cats)",
    "diet": "Obligate carnivore - requires meat-based diet"
  },
  "Bird": {
    "scientific_name": "Aves (Class)",
    "common_name": "Birds (General)",
    "summary": "Birds are warm-blooded vertebrates characterized by feathers, toothless beaked jaws, and the ability to fly (in most species). They have a high metabolic rate, four-chambered heart, and lightweight skeleton.",
    "personality": "Highly vocal and social creatures, often using complex songs for communication, territory defense, and mate attraction. Intelligence varies greatly by species.",
    "likes": "Seeds, insects, berries, fresh water for drinking and bathing, high perches for safety, nesting materials, and flying freely",
    "dislikes": "Predators (cats, hawks, snakes), loud sudden noises, enclosed spaces, extreme weather, and contaminated water",
    "habitat": "Found worldwide in diverse habitats from forests to deserts, mountains to oceans",
    "conservation_status": "Varies by species",
    "population_trend": "Mixed - many species declining due to habitat loss",
    "threats": "Habitat destruction, climate change, pollution, window collisions",
    "fun_fact": "Some birds like crows and parrots can recognize themselves in mirrors, use tools, and solve complex puzzles!",
    "weight_range": "Varies greatly (2g hummingbird to 150kg ostrich)",
    "lifespan": "Varies by species (3-80+ years)",
    "diet": "Varies - seeds, insects, fruits, nectar, fish, small animals"
  },
  "Dog": {
    "scientific_name": "Canis familiaris",
    "common_name": "Domestic Dog",
    "summary": "Dogs are domesticated descendants of wolves and have been human companions for 15,000+ years. They exhibit remarkable diversity in size, appearance, and behavior across 340+ recognized breeds.",
    "personality": "Loyal, social, trainable, and highly attuned to human emotions. Pack animals that thrive on companionship and mental stimulation.",
    "likes": "Walks, running, play time, treats, belly rubs, social interaction with humans and other dogs, mental challenges, and being with their family",
    "dislikes": "Being alone for long periods, harsh discipline, baths (many dogs), thunderstorms, fireworks, and vacuum cleaners",
    "habitat": "Adapted to live alongside humans in diverse environments worldwide",
    "conservation_status": "Not threatened",
    "population_trend": "Stable - estimated 900+ million dogs globally",
    "threats": "None (domesticated species)",
    "fun_fact": "Dogs can understand up to 250 words and gestures, count to five, and their sense of smell is 10,000-100,000 times better than humans!",
    "weight_range": "1-90 kg (varies greatly by breed)",
    "lifespan": "10-13 years (varies by breed and size)",
    "diet": "Omnivore - meat-based diet with vegetables and grains"
  },
  "Cow": {
    "scientific_name": "Bos taurus",
    "common_name": "Domestic Cattle",
    "summary": "Cows are large domesticated herbivores raised for milk, meat, and leather. They are ruminants with a complex four-chambered stomach, allowing them to digest tough plant material efficiently.",
    "personality": "Gentle, social animals with strong maternal instincts. They form close friendships, have excellent memories, and can hold grudges.",
    "likes": "Fresh grass, hay, alfalfa, mineral licks, socializing with herd members, having their heads scratched, and shade on hot days",
    "dislikes": "Being alone, sudden movements, loud noises, dogs chasing them, being separated from calves, and unfamiliar environments",
    "habitat": "Grasslands and pastures; domesticated worldwide for over 10,000 years",
    "conservation_status": "Not threatened",
    "population_trend": "Stable - approximately 1 billion cattle globally",
    "threats": "None (domesticated species)",
    "fun_fact": "Cows have best friends and get stressed when separated! They can also recognize up to 100 faces and remember them for years.",
    "weight_range": "400-900 kg (varies by breed)",
    "lifespan": "18-22 years (production cattle typically 5-6 years)",
    "diet": "Herbivore - grass, hay, silage, grains"
  },
  "Monkey": {
    "scientific_name": "Primates (Order)",
    "common_name": "Monkey",
    "summary": "Monkeys are intelligent primates found in tropical regions. They are highly social animals with complex communication systems, using vocalizations, facial expressions, and body language.",
    "personality": "Playful, curious, social, and intelligent. They live in troops with hierarchical structures. Can be mischievous and are excellent problem solvers.",
    "likes": "Fruits, nuts, leaves, insects, climbing trees, grooming each other, playing, and exploring their environment",
    "dislikes": "Predators (big cats, snakes, eagles), being alone, threats to their troop, and loss of territory",
    "habitat": "Tropical rainforests, savannas, and mountainous regions in Africa, Asia, and Central/South America",
    "conservation_status": "Varies by species (Many threatened/endangered)",
    "population_trend": "Declining for many species",
    "threats": "Deforestation, illegal pet trade, habitat fragmentation, hunting",
    "fun_fact": "Capuchin monkeys can use tools, recognize themselves in mirrors, and even understand the concept of money when trained!",
    "weight_range": "0.1-30 kg (varies greatly by species)",
    "lifespan": "10-50 years (varies by species)",
    "diet": "Omnivore - fruits, leaves, insects, small animals"
  },
  "Chicken": {
    "scientific_name": "Gallus gallus domesticus",
    "common_name": "Chicken",
    "summary": "Chickens are domesticated fowl descended from jungle fowl, raised for eggs and meat. They are social birds with complex communication systems including at least 24 distinct vocalizations.",
    "personality": "Social, curious, and hierarchical (\"pecking order\"). Protective mothers with strong nesting instincts. Surprisingly intelligent and can recognize over 100 faces.",
    "likes": "Dust bathing, scratching for food, foraging for insects and seeds, roosting at night, laying eggs in private nests, and sunshine",
    "dislikes": "Predators (foxes, hawks, snakes), being handled roughly, dirty coops, being isolated from the flock, and rain",
    "habitat": "Adapted to farms and backyards worldwide; originally from Southeast Asian forests",
    "conservation_status": "Not threatened",
    "population_trend": "Stable - over 25 billion chickens worldwide",
    "threats": "None (domesticated species)",
    "fun_fact": "Chickens can recognize and remember over 100 different individuals, including humans! Hens also talk to their eggs before they hatch.",
    "weight_range": "1-4 kg (varies by breed)",
    "lifespan": "5-10 years (egg production typically 2-3 years)",
    "diet": "Omnivore - grains, seeds, insects, vegetables"
  },
  "Donkey": {
    "scientific_name": "Equus africanus asinus",
    "common_name": "Donkey",
    "summary": "Donkeys are domesticated members of the horse family, known for their intelligence, sure-footedness, and strong work ethic. They have been working animals for over 5,000 years.",
    "personality": "Intelligent, cautious, loyal, and stubborn (actually careful thinking, not stubbornness). They are affectionate with trusted companions and have excellent memories.",
    "likes": "Routine, companionship (prefer not to be alone), dust baths, scratches, varied diet of grass and hay, and gentle handling",
    "dislikes": "Being rushed or forced, predators (especially canines), being alone, water crossings (they test depth first), and harsh treatment",
    "habitat": "Originally from African deserts; now found worldwide in farms and rural areas",
    "conservation_status": "Domesticated (wild ancestors critically endangered)",
    "population_trend": "Stable - about 50 million donkeys globally",
    "threats": "Working donkeys face welfare issues in some regions",
    "fun_fact": "Donkeys have incredible memories and can recognize areas and other donkeys they haven't seen for up to 25 years!",
    "weight_range": "180-480 kg (varies by breed)",
    "lifespan": "25-30 years (up to 40+ with good care)",
    "diet": "Herbivore - grass, hay, straw (less than horses)"
  },
  "Frog": {
    "scientific_name": "Anura (Order)",
    "common_name": "Frog",
    "summary": "Frogs are amphibians known for their jumping abilities, distinctive calls, and life cycle transformation from tadpole to adult. They have permeable skin and play crucial roles in ecosystems.",
    "personality": "Opportunistic hunters, mostly nocturnal, territorial during breeding season. Males are highly vocal to attract mates and defend territory.",
    "likes": "Moist environments, insects (flies, mosquitoes, beetles), standing water for breeding, moderate temperatures, and hiding in vegetation",
    "dislikes": "Dry conditions, salt water, pollution, pesticides, extreme temperatures, and bright lights",
    "habitat": "Found on all continents except Antarctica; need water or high humidity for survival",
    "conservation_status": "Varies (Many species critically endangered)",
    "population_trend": "Declining rapidly - amphibian crisis",
    "threats": "Habitat loss, climate change, pollution, chytrid fungus disease",
    "fun_fact": "Some frogs can freeze solid in winter and thaw out alive in spring! Wood frogs can survive with 65% of their body water frozen.",
    "weight_range": "0.5g-3kg (varies greatly by species)",
    "lifespan": "2-15 years (varies by species)",
    "diet": "Carnivore - insects, worms, small invertebrates"
  },
  "Sheep": {
    "scientific_name": "Ovis aries",
    "common_name": "Domestic Sheep",
    "summary": "Sheep are domesticated ruminants raised for wool, meat, and milk. They have been companions to humans for over 10,000 years and are known for their flocking behavior and excellent memories.",
    "personality": "Social, timid, and have strong flocking instincts for safety. Despite reputation, they are quite intelligent and can recognize faces. They form strong bonds with flock members.",
    "likes": "Grazing on grass and clover, staying with their flock, shade and shelter, fresh water, and having their fleece removed in hot weather",
    "dislikes": "Being alone or separated from flock, predators (wolves, coyotes, dogs), being on their backs (vulnerable position), and sudden movements",
    "habitat": "Grasslands and pastures worldwide; adapted to various climates from mountains to lowlands",
    "conservation_status": "Not threatened",
    "population_trend": "Stable - over 1 billion domestic sheep globally",
    "threats": "None (domesticated species)",
    "fun_fact": "Sheep have rectangular pupils giving them 270-320° vision without turning their heads! They can recognize human faces and remember them for years.",
    "weight_range": "45-160 kg (varies by breed)",
    "lifespan": "10-12 years (production sheep typically 5-7 years)",
    "diet": "Herbivore - grass, hay, grains"
  }
}